#### WallUtils Members

---

|  |
| --- |
| WallUtils Class   Methods   See Also |

The  WallUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AllowWallJoinAtEnd | Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result. |
| Public method Static member | DisallowWallJoinAtEnd | Sets the wall's end not to join to other walls. |
| Public method Static member | IsWallJoinAllowedAtEnd | Identifies if the indicated end of the wall allows joins or not. |

# See Also

WallUtils Class

Autodesk.Revit.DB Namespace